{
    "imDbId": "tt1160419",
    "title": "Dune",
    "fullTitle": "Dune (2021)",
    "type": "Movie",
    "year": "2021",
    "items": [
        {
            "username": "SnoopyStyle",
            "userUrl": "https://www.imdb.com/user/ur2898520",
            "reviewLink": "https://www.imdb.com/review/rw7466621",
            "warningSpoilers": true,
            "date": "21 October 2021",
            "rate": "8",
            "helpful": "416 out of 703 found this helpful.",
            "title": "Villeneuve epic",
            "content": "Denis Villeneuve directs this remake of the Frank Herbert classic sci-fi. It's the first part of two movies. Timothée Chalamet is the lead as Paul Atreides. The emperor has given his family the desert planet Arrakis where the most important spice is mined. It's a trap and everyone knows it.I've never read the book. I have seen the David Lynch version and the Sci Fi movies. I do miss some of the Lynchian weirdness. This version feels more Earth-bound without the weirdness. Arrakis has a lot more middle eastern influences. House Atreides is more Scottish. I do wish that they get rid of the damn bagpipes. One hopes that they would get rid of that noise in a few thousand years. As for Chalamet, he is the perfect prettiness for the role. He looks too pretty to be believed as a fighter which is exactly what every other character comments on about him. He has the ethereal look of an angelic hero in an ancient classical Greek story. I'm not sure if newbies could get lost in this labyrinthian world. It's not really that complicated. I think Villeneuve has made the right movie. He puts his skills into the epic feel of this franchise. It feels right... coming from a non-book-reader."
        },
        {
            "username": "Hitchcoc",
            "userUrl": "https://www.imdb.com/user/ur0278527",
            "reviewLink": "https://www.imdb.com/review/rw7468495",
            "warningSpoilers": false,
            "date": "22 October 2021",
            "rate": "8",
            "helpful": "401 out of 678 found this helpful.",
            "title": "The Beginning",
            "content": "Having read the book a hundred years ago, it took some time to begin to understand what was going on. If there is a criticism that many share, it is the pacing of the first part of the film. It needed something to set the scene for us, to show us who the strong and the weak were. I'm not much for narration (show me, don't tell me), but it may not have been a bad idea. The scenes are magnificent with special effects off the chart. Many desert travel scenes are quite endless. How do you spruce up a desert. I thought the sand worms were a little one dimensional. I know there is another film down the road."
        },
        {
            "username": "Kirpianuscus",
            "userUrl": "https://www.imdb.com/user/ur61197531",
            "reviewLink": "https://www.imdb.com/review/rw7478502",
            "warningSpoilers": false,
            "date": "24 October 2021",
            "rate": "",
            "helpful": "64 out of 181 found this helpful.",
            "title": "inspired sketch",
            "content": "It is not a simple film. But an adaptation of one of real difficult to adapt at his standards novel. And, honestly, this Dune: Part One is just seductive at visual level. But, I admitt, I am far to be very enthusiastic about it. Maybe, I am to attached to old adaptations - first 2000 one - , maybe I feel the novel in different way than the director, maybe I am too old at 45 year old, maybe I am tired or too far by contemporary cinematographic taste. Yes, the image is completed by inspired performances, the poetry of desert is well reflected , the cliches are at fair place , the relation mother - son has its charme in Oedip - like manner and the portrait of Baron Vladimir Harkonnen is more than wise crafted. And the young Chalamet proves his real skills as admirable actor, Jason Momoa surviving to his character in very nice manner. No doubts, the film represents a generous gift to public from an ambitious director. Is it enough ? Maybe ."
        },
        {
            "username": "Horst_In_Translation",
            "userUrl": "https://www.imdb.com/user/ur3914439",
            "reviewLink": "https://www.imdb.com/review/rw7383859",
            "warningSpoilers": true,
            "date": "26 September 2021",
            "rate": "6",
            "helpful": "406 out of 1,756 found this helpful.",
            "title": "If this film was a planet, then it could be fine for temporary stay, permanent not really though",
            "content": "\"Dune\" is a really new American movie from 2021 that just got released and I saw that people really liked it, so I got curious and decided to check it out myself. It is a pretty long movie at slightly under 2.5 hours and the director is Denis Villeneuve, perhaps one of the most influential filmmakers right now and maybe number one from Canada. He is also one of the writers and the writing staff also includes an Oscar winner. You can check out the names there yourself. I shall instead elaborate a little more on the cast. Villeneuve being in charge resulted in many big names becoming a part of this project. The lead actor here is Timothée Chalamet, definitely a rising star, but I must say I am not the biggest fan of him really. This is a bit of a problem as he is basically in this movie from beginning to end, but luckily, the supporting cast includes more than a handful actors that I like quite a bit. These would be Oscar Isaac, Josh Brolin and Javier Bardem. With Brolin and Bardem, it felt like a bit of a reunion from No Country for Old Men, especially during the one brief scene/moment in which they clash to some extent. And as we are already talking Coen Bros movies, Isaac's Inside Llewyn Davis deserves a mention as well for sure. So you will find a few actors in here who have worked with the maybe most famous filmmaking brothers duo in the past. Brolin is featured heavily in the first half of the film, but then vanishes completely. Isaac also has more screen time early on. Bardem has a brief scene when his character is introduced, but appears in the last 30 minutes again. I personally thought that he would not show up again with this film, but play a central role in the second movie. Yes, there is a sequel indeed. This already becomes clear when this film here starts as we see a \"part one\" or something and also the way this one ends makes it very obvious that this is not it.As for the rest of the cast, Rebecca Ferguson is almost lead as well, which was okay. Zendaya I am still not buying the hype and she is only really in it near the end. Momoa is on the good side, while Skarsgard and Bautista are on the enemy team. The latter is really making himself a career now if you take a look at everything he has been in, even if it is always supporting parts. His recognition value probably helps as well. Oh yeah, Charlotte Rampling also has a memorable scene in here. I will get to that/her later. Of course, people will immediately think of the David Lynch Dune movie from decades earlier. I will not talk about parallels or differences now with that one because I have not seen it. Let's just focus on this one here instead from a standalone perspective. There is enough to elaborate on anyway. I must still say that I struggle with seeing Chalamet as some kind of hero or chosen character. I don' think he has the props to really pull it off. Of course, this is the idea that he does not look like Hulk or Thor or something, but when I see him show his dedication like how he really wants to join Momoa's character or how he can defeat Brolin's character in a duel or how he leads his mother in the desert and knows exactly how his items and uniform work because he is such a natural or how he in the end says his path leads through the desert, it is difficult to believe. Also how he of course wins the battle against this fella near the end who challenges him. And he has to kill in the process, which also shows us how much of a kindred spirit he is that he has never killed somebody before.Death is a crucial component in here. Still I must say seeing how literally every single good guy, be it Isaac's character, be it Momoa's, be it the seer, goes out in a heroic manner that puts harm to the enemy side was a bit much and eventually also repetitive. There were other issues I struggled with here in terms of the plot. Take a look at the idea of Chalamet's character playing a real hero. Basically he is the future. And yet, his own folk (Rampling's character) were ready to kill him immediately with this poisonous needle if he pulls out his hand from this box that caused so much pain to him. Or his dreams and premonitions linked to Zendaya's character were also not exactly new or inspired the way they were put on display here. I could go on by saying that for example the introduction did feel too long and this movie could have been (or should have been) half an hour shorter perhaps. What I cannot say anything negative about is really the way in which the bad guys attack. When they come for Isaac's character and the others, it is really spectacular and this is when this film is at its very best and an incredibly tense thrill ride. In the middle of the film. Unfortunately, when this is over and the bad guys have won for the moment, it gets a bit weaker again and here and there it drags a bit and has some lengths. What also can be said is that this film is never really intended for comedic purpose. The way you could see it a lot on another Bautista fantasy/sci-fi movie. There was this one moment when Momoa's character talks about Chalamet's character's muscles that was a bit on the playful comedic site and maybe one or two other inclusions as the film went on, but yeah this is not a movie to pick for light relief or something. It takes itself very seriously. Does it have the right to? I am not sure.Of course, there is absolutely nothing wrong with sets, cinematography, costumes and all other visual/audible production fields, but this is pretty much a given now with a film of this dimension, even if we maybe should not see it as a given. With the likes of Zimmer, Roberts and West in charge, however, there is at least as much competence available in \"minor\" departments as there is in front of the camera. If not more. But back to the action itself: With the spectacular visuals, this is definitely a movie you'd rather want to check out at a theater than at home on a small screen. Unless you have a home theater of course. Oh yeah, another moment that will maybe make you smile is how Isaac's character tries to get Brolin's grumpy character to smile really early on. The latter reminds me a bit of the man Brolin played on Sicario. Anyway, I guess we will see more from Brolin's character in the sequel here as well. As for Villeneuve, I must say I liked his earlier stuff like Prisoners, but his recent take on Blade Runner did almost nothing for me unfortunately. Quality-wise, this movie here is somewhere in-between. It's not a revelation or anything and I think the reception is way too positive (I even saw people consider Chalamet for an Oscar nomination, like come on!), but it is worth seeing if you like the genre and some of the cast members I suppose. Not a must-see by any definition though. Seems as if Villeneuve really enjoys giving us his take on some films that are considered classics. It certainly could have turned out worse here, but I hope that with whatever he does in the future, also after this sequel here, he can manage to be a bit more essential again. The pathos felt a bit much at times and did not always ring true. This maybe also could have had to do with Chalamet for me though. If you like him more, you will maybe not see it.The attention to detail at times was still pretty good. I liked Brolin's words during the training sequence linked to Chalamet's character expressing he is not in the mood for fighting or so and how he has to fight when the time is right and how this felt connected to his battle with one character near the end. Completely aside from that, I initially struggled with the sand component, but in the second half they turned the background and location into something special and you could feel the endless desert element finally. Also the idea of these sandworms was depicted nicely. Or how a ring is used to print a seal or signature. Or these helicopters that look like insects. Or the little drone, so it is not just the big spectacular inclusions where you can see all the talent that was included in the making of this film. Unfortunately, there were also many struggles. I mentioned most of them, but while I already stated that the introduction felt too long, the real introduction at the very start felt incredibly rushed and it was impossible to remember all they mentioned there. Pretty much a no-go for a film with this running time. All in all, I still give it a thumbs-up and I think the good is more frequent than the weak, but there's no way I would say that this is among the very best films of the year 2021 so far. Maybe the better, but not the best and I hope that Villeneuve can step things up with the second film, but given the lead actor I kinda doubt it. Anyway, if you like this one, you can probably keep watching. Maybe said sequel is out already once you read this review of mine and then you can decide for yourself anyway. (tt1160419)"
        },
        {
            "username": "nogodnomasters",
            "userUrl": "https://www.imdb.com/user/ur77881167",
            "reviewLink": "https://www.imdb.com/review/rw7442943",
            "warningSpoilers": true,
            "date": "15 October 2021",
            "rate": "8",
            "helpful": "177 out of 544 found this helpful.",
            "title": "The Desert takes the weak",
            "content": "The Duke (Oscar Isaac) is sent by the empire to take control of the spice operations on Arrakis, which sounds like Iraqis. It is inhospitable and the locals have seen empires come and go who try to rule over them. (Reminded me of Afghanistan.) The Duke wants to have peace. The Duke's son Paul (Timothée Chalamet) is the main character and has too much of his mother (Rebecca Ferguson) in him. She comes from a long line of witches and he has some of their powers such as \"The Voice\" and \"The Sight\" which is similar to \"The Force.\" He dreams of a girl (who doesn't?) and of things to come. As it turns out, the empire was quite honest with them.I have never read the book. Three of us watched the first one on VHS and fell asleep during the film. The machines looked like they came out of \"Star Wars.\" They needed some good music background.Guide: No swearing, sex, or nudity."
        },
        {
            "username": "Sleepin_Dragon",
            "userUrl": "https://www.imdb.com/user/ur15311310",
            "reviewLink": "https://www.imdb.com/review/rw7475243",
            "warningSpoilers": false,
            "date": "23 October 2021",
            "rate": "10",
            "helpful": "680 out of 956 found this helpful.",
            "title": "My movie of 2021, so far.",
            "content": ""
        },
        {
            "username": "classicsoncall",
            "userUrl": "https://www.imdb.com/user/ur2707735",
            "reviewLink": "https://www.imdb.com/review/rw7469852",
            "warningSpoilers": true,
            "date": "22 October 2021",
            "rate": "9",
            "helpful": "385 out of 598 found this helpful.",
            "title": "\"He shall know your ways as though born to them.\"",
            "content": "It's been some time since I've read the Frank Herbert novel, and I had already forgotten much of the story. However it wasn't a problem picking things up as characters and situations presented themselves in this film, so I'd have to say that was a plus for this viewer. The scope of this picture is quite outstanding, spanning as it does a complex and fragmented universe of worlds and kingdoms. Central to the story is the valued importance placed on a spice that's a preferred hallucinogenic for some, and for the elite, an important component required for interstellar travel. In the novel I believe it was something as common as cinnamon, but on the planet Arrakis, required an intensive mining operation to reclaim it from the barren desert soil in which it's found.The entire story is veiled with a mystical sort of ambiance in which the protagonist, Paul Atreides (Timothée Chalamet), learns of his destiny while obliquely being referred to as 'The One' of legend, a person who will come into great power. Quite honestly, the setting, costuming, characterizations and palace intrigue is all quite reminiscent of 'Star Wars', even if the original novel was written over a decade before George Lucas arrived on the scene. Even the hostile environment of Arrakis has the feel of Tatooine, with the appearance of the Shai-Hulud recalling the Sarlacc, one of Jabba the Hutt's favorite pets.What surprised me with this first installment of the Dune saga was how well director Denis Villeneuve managed to condense the epic scope of a massive novel onto film, even if half of the story is yet to be told. The movie incorporates the most critical elements of the novel into a narrative that works really well. Even though I actually did enjoy the 1984 version directed by David Lynch, this one proves to be more inclusive of events in the novel, and I look forward to a successful conclusion to the saga in due time."
        },
        {
            "username": "lee_eisenberg",
            "userUrl": "https://www.imdb.com/user/ur4888011",
            "reviewLink": "https://www.imdb.com/review/rw7485290",
            "warningSpoilers": false,
            "date": "27 October 2021",
            "rate": "8",
            "helpful": "44 out of 98 found this helpful.",
            "title": "destiny will come",
            "content": "I've never read Frank Herbert's novel or seen any other adaptation of \"Dune\", so I have to take Denis Villeneuve's adaptation as the guide. It's an impressive movie. Not just the visuals, but in the story's complexity. Timothée Chalamet continues to reaffirm himself as one of the greatest actors of his generation.I'm eager to see part 2, as well as David Lynch's adaptation."
        },
        {
            "username": "jboothmillard",
            "userUrl": "https://www.imdb.com/user/ur4248714",
            "reviewLink": "https://www.imdb.com/review/rw7501173",
            "warningSpoilers": true,
            "date": "1 November 2021",
            "rate": "7",
            "helpful": "18 out of 36 found this helpful.",
            "title": "Dune",
            "content": "The 1984 David Lynch movie was a box office flop and has been garnered with mixed to negative reviews over the years, but the trailer for the new movie, based on the cult book by Frank Herbert, looked like it would be much better, directed by Denis Villeneuve (Prisoners, Arrival, Blade Runner 2049). Basically, in the distant future, the year, 10,191, in the known universe, Duke Leto of House Atreides (Oscar Isaac), ruler of the ocean planet Caladan, is assigned by the Padishah Emperor Shaddam Corrino IV to replace House Harkonnen as fief rulers of Arrakis. The planet Arrakis is a barren desert planet populated by gigantic sandworms, better known as Dune. It is the universe's only source of the spice called melange, a drug that extends life and expands consciousness. The Spice is also critical for safe instantaneous interstellar travel to any distance in space. Shaddam intends to have House Harkonnen stage a coup to retake the planet with aid of the Emperor's Sardaukar troops, eradicating House Atreides, who threaten Shaddam's control. Leto is apprehensive but sees the political advantages of controlling the spice planet, and an alliance with its native population, skilled fighters known as the Fremen. Leto's concubine Lady Jessica (Rebecca Ferguson) is part of the Bene Gesserit, an exclusively female order with advanced physical and mental abilities. Although Jessica was instructed by the Bene Gesserit to bear a daughter to descend and become the Kwisatz Haderach (\"one who can be many places at once\"), she instead gave birth to a son, Paul (Timothée Chalamet). Throughout his life, Paul has been trained by Leto's aides, Duncan Idaho (Jason Momoa), Gurney Halleck (Josh Brolin) and the Mentat Thufir Hawat (Stephen McKinley Henderson), while Jessica trains Paul in disciplines of the Bene Gesserit. Paul talks to Jessica and Duncan about troubling visions he has had of the future. Due to these visions, the Reverend Mother Gaius Helen Mohiam (Charlotte Rampling) visits Caladan and subjects Paul to a deadly test. He is subjected to experience excruciating pain to his hand, to assess his impulse control, which he passes. Later, Mohiam instructs House patriarch Baron Vladimir Harkonnen (Stellan Skarsgård) to not kill Paul and Jessica during his coup. He agrees not to harm them but intends to cause their deaths indirectly to end their bloodline. House Atreides arrives at Arrakeen, capital city and fortress stronghold on Arrakis, where Duncan and an advance party have been learning about the world and the Fremen. Leto negotiates with the Fremen's chieftain Stilgar (Javier Bardem) and meets planetologist and imperial judge Dr. Liet-Kynes (Sharon Duncan-Brewster). Kynes explains the dangers of spice harvesting to Leto, Paul, and Halleck, including the giant sandworms. During a flight, they spot a sandworm approaching an active spice harvester with a stranded crew. Leto and his team rescue the workers moments before the sandworm swallows it. Paul's exposure to spice-laden air triggers intense premonitions. Following an attempt by a Harkonnen agent to kill Paul, Leto's soldiers are put on high alert. Suk doctor Wellington Yueh (Chang Chen) disables Arrakeen's critical protective shields, allowing Harkonnen and Sardaukar troops to overwhelm the Atreides forces. Yueh incapacitates Leto and tells him he made a deal with the Baron to deliver him in exchange for freeing his captive wife. Yueh poisons Leto with a gas capsule and is killed after delivering the Duke. Leto releases the poison gas, killing himself and members of the Baron's court, but the Baron survives. Duncan escapes and steals an ornithopter (an aircraft with rapidly flapping wings). Harkonnens capture Paul and Jessica and intend to drop them in the desert to perish. Paul and Jessica overpower and kill their captors using a Bene Gesserit power called \"The Voice\" to control others verbally. Finding a survival kit left for them by Yueh, Paul and Jessica spend the night in a tent. Paul experiences visions of a \"holy war\" spreading across the universe and him leading it. The Baron hands over command of Arrakis to his brutish nephew Rabban aka \"Beast\" (Dave Bautista) and orders him to sell spice reserves and restart production to recover the cost of the coup. Paul and Jessica are found by Duncan and Kynes and head to an old research station but are soon tracked down by Sardaukar. Jessica, Paul and Kynes are allowed to escape the facility when Duncan and various Fremen sacrifice themselves. Kynes, ambushed by Sardaukar troops, lures a sandworm that devours them along with her. Paul and Jessica reach the deep desert and meet the Fremen, among them are Stilgar and young warrior Chani (Zendaya), who Paul has seen in his visions. Their admission into the tribe is protested by Fremen warrior Jamis (Babs Olusanmokun), so they have a ritual duel to the death, and Paul is victorious. Against Jessica's wishes, Paul states they will remain on Arrakis with the Fremen to reclaim the planet. Also starring David Dastmalchian as Piter de Vries, Benjamin Clémentine as Herald of the Change, Golda Rosheuvel as Shadout Mapes, and Roger Yuan as Lieutenant Lanville. I'm not going to pretend I understood everything going on, with all the stuff involving religion and politics, just the main plot that everyone wants the spice. Chalamet makes for a good young hero, Skarsgård is good at being the nasty and grotesque villain, and the all-star cast, including Isaac, Brolin, Rampling, Zendaya, and Bardem all get their moments as well. The visuals and special effects are fantastic, from the spaceships and alien creatures to the interior and exterior locations and large-scale battle scenes, so it doesn't matter if you don't understand it all, it is a great spectacle, and hopefully the second part will be as exciting, a worthwhile epic science-fiction adventure. Very good!"
        },
        {
            "username": "paul_haakonsen",
            "userUrl": "https://www.imdb.com/user/ur22654354",
            "reviewLink": "https://www.imdb.com/review/rw7456844",
            "warningSpoilers": false,
            "date": "18 October 2021",
            "rate": "6",
            "helpful": "489 out of 1,707 found this helpful.",
            "title": "Visually impressive, but rather unnecessary remake...",
            "content": ""
        },
        {
            "username": "Gordon-11",
            "userUrl": "https://www.imdb.com/user/ur0035842",
            "reviewLink": "https://www.imdb.com/review/rw7353221",
            "warningSpoilers": false,
            "date": "17 September 2021",
            "rate": "",
            "helpful": "99 out of 357 found this helpful.",
            "title": "I liked it",
            "content": "The visuals are pretty impressive. Even though the colour palette is monotonous, the visuals are beautiful and captivating. The story is ending, albeit slow at times. I really like Timothee Chamalet's character. Overall, I liked it."
        },
        {
            "username": "CinemaSerf",
            "userUrl": "https://www.imdb.com/user/ur107065132",
            "reviewLink": "https://www.imdb.com/review/rw7479787",
            "warningSpoilers": true,
            "date": "25 October 2021",
            "rate": "7",
            "helpful": "42 out of 102 found this helpful.",
            "title": "Classic and sophisticated sci-fi at it's best.",
            "content": "Fans of \"Lawrence of Arabia\" (1962) might recognise the bleak scenery around Wadi Rum, one of many stunningly beautiful and evocative locations used is this epic piece of cinema. It is that photography, and another hugely complimentary score from Hans Zimmer, that perfectly sets the template for this adaptation of Frank Herbert's story of family, avarice and power. I was sceptical about it being split into two parts (especially given the lengthy delay between this and the sequel) but it really works well. The unseen Emperor of the Known Universe commands that house \"Atreides\" take over the mining of the valuable \"spice\" from their arch enemy the \"Harkonnen\", and so the Duke (Oscar Isaac), his wife \"Jessica\" (Rebecca Ferguson) and son \"Paul\" (Timothée Chalamet) must prepare to relocate to their new and distinctly hostile desert world. It is clear from the outset that young man is troubled. He sleeps fitfully with strange dreams all set upon a planet he has studied but never visited. Upon arrival, they are betrayed and the young man and his mother must find and befriend the local \"Fremen\" population and learn how to survive and to fight back. Now I won't fib, it does drag a bit at times, and if you already know the story from either the book, or the David Lynch version from 1984, then that can lead to you wanting to shout \"get on with it\" at the big screen, but being patient with this brings it's own rewards. The attention to the detail, and the grand scale of this feature is immersive, it draws you in and there is enough action, and food-for-thought to sustain that interest for the most part. Chalamet offers us a strong and engaging performance. He is growing as an actor, maturing - and though he still looks like a decent meal would kill him, he owns the picture in a way (for me, anyway) that he never has before. The remaining cast members gel well together, and the mysticism and political manoeuvring that underpins this story is subtle and nuanced but potent in it's presentation. The costumes and visual effects are splendid - I want one of the locust-copters (though heaven only knows what the vibrations must be like onboard!), and we do get a sense - but really only that - of the enormity of the giant worms that patrol the desert looking for their quarry. The second part of the novel was always the more interesting. We will see the characters develop more, and we will learn more of the troubled \"Paul\" and of whom he really is - as well as there being much more actually going on. If this is the standard of the opening gambit, then what is to come ought to be wonderful."
        },
        {
            "username": "zardoz-13",
            "userUrl": "https://www.imdb.com/user/ur2079400",
            "reviewLink": "https://www.imdb.com/review/rw7492940",
            "warningSpoilers": true,
            "date": "29 October 2021",
            "rate": "10",
            "helpful": "116 out of 188 found this helpful.",
            "title": "Villeneuve's Greatest Sci-Fi Film",
            "content": "Watching director Denis Villeneuve's groundbreaking adaptation of Frank Herbert's classic science fiction novel \"Dune\" is like feasting on an all-you-can-eat buffet. You can gorge yourself on combatants and conspiracies galore during its spartan 156-minute runtime. Unlike its ill-fated predecessor, David Lynch's critically reviled \"Dune\" (1984), which shoehorned Herbert's gargantuan magnum opus into a procrustean 136-minute escapade, Villeneuve has the good sense not to pile everything into one film. Instead, this $165 million reboot delivers only half of the chronicle, while we must bide our time until the sequel. Some sci-fi fans may cringe at this prospect, but Warner Brothers refused to bank roll the sequel before \"Dune\" generated some box office traction. Mind you, sitting for two-hours and thirty-six minutes requires not only purpose but also patience. Meantime, Villeneuve retreads several Lynch scenes, but does it with greater scope and spontaneity. You cannot help but be caught up by the rollercoaster blend of white-knuckled cliffhanger heroics and Byzantine political intrigue. Although classified as science fiction, \"Dune\" never degenerates into a juvenile \"Buck Rogers\" space opera. \"Star Wars: Rogue One\" lenser Greg Fraser depicts these larger-than-life characters against surreal landscapes in sprawling picturesque murals. Surrounding Timothée Chalamet, who toplines as the hero, is a formidable cast consisting of Oscar Isaac, Josh Brolin, Rebecca Ferguson, Jason Momoa, Javier Bardem, Dave Bautista, and Stellan Skarsgard. Overall, \"Dune\" raises the standards for sci-fi blockbusters. Nevertheless, the filmmakers don't bewilder the audience with narrative overload. Clearly, Villeneuve has surpassed his earlier outing \"Blade Runner 2049\" (2017), and one can only wish him greater success with this sequel.Imagine a mash-up of \"Star Wars\" and \"Game of Thrones,\" and you'll have a clue about what ensues. Specifically, \"Dune\" takes place in the year 10,191. This tour de force saga of clashing empires unfolds on the bleak desert planet of Arrakis. This savage, sun-scorched world is the only source in the universe for a unique mineral called spice. Not only does interstellar space travel hinge on spice, but it also is a psychedelic drug that heightens awareness and lengthens life. The evil Baron Vladimir (Stellan Skarsgård of \"Good Will Hunting\") of the House of Harkonnen, who amounts to a smaller version of Jabba the Hutt, has reaped an obscene fortune in spice from Arrakis over the last 80 years. Now, the Padishah Emperor Shaddam IV removes the Baron and replaces him with a rival, Duke Leto Atreides (Oscar Isaac of \"Ex-Machina\") of the mighty House of Atreides, who hails from the ocean planet of Caladan. Accompanied by his consort Lady Jessica (Rebecca Ferguson of \"Doctor Sleep\") and their teenage son, Paul (Timothée Chalamet of \"Lady Bird\"), the Duke arrives on Arrakis with his aide, Gurney Halleck (Josh Brolin of \"Sicario\"), and a vast army. Leto suspects the corrupt Emperor may be setting him up for failure.Pandemonium erupts soon after Leto has taken over the spice mining operation. Earlier, the Duke had vowed to forge an alliance with the natives. Known as the Fremen, this disgruntled nomadic race resides in Arrakis's deep caverns and conducts campaigns like guerrilla warriors against the spice miners. Suffering dreadfully under the Baron, the Fremen expect similar treatment from Leto. The Duke dispatches a scout, Duncan Idaho (Jason Momoa of \"Aquaman\"), to embed himself among them and win their hearts and minds. Swathed in hooded white cloaks, this mahogany-skinned tribe has dazzling cobalt blue eyes from using spice. A blue-eyed babe haunts Paul's dreams. Meantime, the mining equipment Leto inherited from the Baron is in rough shape. If the broiling temps on the surface weren't bad enough, prodigious sandworms--some as long as 13-hundred feet--cruise beneath the shifting sands like great white sharks. These leviathans can wrap their elastic mouths, bristling with zillions of wicked, razor-sharp fangs, around an entire spice harvesting machine. Eventually, treachery within Leto's palace topples his rule, and the Baron's soldiers annihilate Atreides' army. Miraculously managing to escape, young Paul takes refuge with the Fremen and ponders a rebellion against the Baron.Comparisons between \"Dune\" and \"Star Wars\" are inevitable. Indeed, both films share certain formulaic scenes which seem virtually interchangeable. An empire-building yarn with anti-colonial sentiments, \"Dune\" takes itself far more seriously than \"Star Wars.\" When Paul watches his mentor perish, our hero suffers as tragically as Luke when he witnessed the demise of Obi-wan Kenobi. \"Dune\" differs, too, because it is a sword and sandal saga about supernatural critters. Arrakis makes Tatooine seem like a beach resort. Villeneuve and \"Prometheus\" writer Jon Spaihts and \"A Star Is Born\" scripter Eric Roth don't overwhelm the audience with volumes of exposition that cluttered up the Lynch film. Instead, they parcel out exposition and use it to foreshadow events. The warfare is conducted with ancient as well as futuristic weapons, with emphasis on ancient weapons. The dragonfly helicopters-known as ornithopters-look exciting. The crisp dialogue is both pointed and compelling. Villeneuve and company never cut our underdog heroes any slack in this initial bloodthirsty chapter, and the evil Baron maintains the upper hand despite minor setbacks like a near-death experience. As villains go, the grotesquely fat Baron makes an admirable but unscrupulous adversary. Josh Brolin and Jason Momoa wield their weapons like old hands. Unlike Lynch, Villeneuve doesn't rub our noses in unsavory violence. Nonetheless, the battles are savage without being sadistic. Hans Zimmer's brawling orchestral score with native choral interludes enhances the atmosphere. Altogether, \"Dune\" qualifies as the first truly great science fiction classic of the 21st century with a coming-of-age hero driven by prophetic dreams he cannot fathom."
        },
        {
            "username": "neil-476",
            "userUrl": "https://www.imdb.com/user/ur7813355",
            "reviewLink": "https://www.imdb.com/review/rw7482879",
            "warningSpoilers": true,
            "date": "26 October 2021",
            "rate": "8",
            "helpful": "35 out of 85 found this helpful.",
            "title": "At last",
            "content": "Spice, a substance mined only from the deserts of planet Arrakis, is the most valuable commodity in the galaxies since it enables interstellar transport. The violent and sadistic Harkonnen family have help the spice mining franchise for 40 years, becoming immensely wealthy in the process, alienating Arrakis natives the Fremen in the process. The Emperor abruptly appoints the Atreides family instead, infuriating the Harkonnens who sabotage equipment left behind, and plan a violent takeback. This results in heir apparent Paul Atreides and mother Jessica being abandoned in the desert, where they need to fall in with desert experts the Fremen in order to survive. Trouble is, after 40 years of the Harkonnens, the Fremen aren't very keen on offworlders.And.... end of part one. We are halfway through the story, with a part two which may never be greenlit if box office doesn't justify it which, in this post-covid world sounds somewhat unlikely. So what's part one like?My history of Dune and director Denis Villeneuve meant I was not hopeful. I read the novel in my teens in the 1960s and found it dense and impenetrable. David Lynch's movie had its moments, but got hacked about by the studio. The later TV series was more lucid, but suffered from some really poor casting and acting. And I had problems with Glade Runner 2049 and Arrival, both of which were a bit too cerebral for me, and less clear than I would have liked from a narrative stanndpoint.Dune (part one) 2021 is a fine film. It looks amazing, which one would expect these days. The casting - and acting - is excellent. And the script/adaptation is first rate. The power games which underlie the main plot are clear and obvious, the interplay of character dynamics is solid, subtle story points come through, all the little bits you need to understand are explained organically without huge obvious information dumps, and the story flows easily throughout the two and a half hours.I have two reservations. One, the film isn't as significant as it sometimes seems to think it is. And, two, Hans Zimmer's score is dissonant, intrusive and aggressive and I actively disliked it.But I liked the film very much, and I greatly hope there will be a part two."
        },
        {
            "username": "evanston_dad",
            "userUrl": "https://www.imdb.com/user/ur4532636",
            "reviewLink": "https://www.imdb.com/review/rw7528639",
            "warningSpoilers": false,
            "date": "8 November 2021",
            "rate": "4",
            "helpful": "31 out of 49 found this helpful.",
            "title": "Lifeless, Emotionless, and Dull",
            "content": ""
        },
        {
            "username": "ferguson-6",
            "userUrl": "https://www.imdb.com/user/ur0806494",
            "reviewLink": "https://www.imdb.com/review/rw7466167",
            "warningSpoilers": false,
            "date": "21 October 2021",
            "rate": "7",
            "helpful": "90 out of 178 found this helpful.",
            "title": "stunning visuals",
            "content": ""
        },
        {
            "username": "deloudelouvain",
            "userUrl": "https://www.imdb.com/user/ur58525162",
            "reviewLink": "https://www.imdb.com/review/rw7517932",
            "warningSpoilers": false,
            "date": "6 November 2021",
            "rate": "8",
            "helpful": "8 out of 22 found this helpful.",
            "title": "I can't wait for part two, and hope for more parts after that if they're of the same quality as this one.",
            "content": "I barely remembered anything from the 1984 Dune movie, only that I liked it at that time. But this remake is certainly something else. The progress we made now, technologically speaking, is just from another world. The visuals in Dune: Part One are just stunning with amazing spaceships and other tech. That alone is worth watching this movie. If you're a sci-fi fan you really can't go wrong with this one, it's all very mindblowing. The story itself is also entertaining. I can't wait to watch the second part to be honest. As for the acting, the whole cast did its best, they all gave convincing performances. At first I thought did we really need another remake of a 37 year old movie? Can't they come with something new? But I was wrong, this movie is totally worth watching, just for the visuals alone it's already worth it."
        },
        {
            "username": "siderite",
            "userUrl": "https://www.imdb.com/user/ur3146136",
            "reviewLink": "https://www.imdb.com/review/rw7470823",
            "warningSpoilers": false,
            "date": "22 October 2021",
            "rate": "8",
            "helpful": "156 out of 337 found this helpful.",
            "title": "More of a remake of Lynch's film, rather than an adaptation of the book",
            "content": ""
        },
        {
            "username": "thesar-2",
            "userUrl": "https://www.imdb.com/user/ur17825945",
            "reviewLink": "https://www.imdb.com/review/rw7508325",
            "warningSpoilers": false,
            "date": "4 November 2021",
            "rate": "4",
            "helpful": "39 out of 102 found this helpful.",
            "title": "Long, Over-Dune",
            "content": ""
        },
        {
            "username": "cherold",
            "userUrl": "https://www.imdb.com/user/ur0011762",
            "reviewLink": "https://www.imdb.com/review/rw7499480",
            "warningSpoilers": false,
            "date": "31 October 2021",
            "rate": "3",
            "helpful": "108 out of 220 found this helpful.",
            "title": "painfully tedious adaptation of an overrated novel",
            "content": "I wasn't a big fan of Dune when I read it. It was like a sci-fi/fantasy take on an old sword-and-sandal political intrigue thing, complete with dull characters and dumb story.On the other hand, it had this wonderfully anthropological creation of a desert world and its people. That was the only reason I got through it.Dune Part One is the first part without the second part. The characters are still dull, the plot still dumb, and the sci-fi world-building almost non-existent. The scenery and special effects are quite good, but nothing is interesting; even action scenes are listless.Will Dune Part Two offer the world-building that was the only good part of the book? Doubt it. Anyway, I certainly can't take any more of this."
        },
        {
            "username": "FeastMode",
            "userUrl": "https://www.imdb.com/user/ur104603847",
            "reviewLink": "https://www.imdb.com/review/rw7469184",
            "warningSpoilers": false,
            "date": "22 October 2021",
            "rate": "7",
            "helpful": "60 out of 134 found this helpful.",
            "title": "visual and auditory explosion of beauty",
            "content": ""
        },
        {
            "username": "inkblot11",
            "userUrl": "https://www.imdb.com/user/ur2444068",
            "reviewLink": "https://www.imdb.com/review/rw7507702",
            "warningSpoilers": false,
            "date": "3 November 2021",
            "rate": "10",
            "helpful": "22 out of 49 found this helpful.",
            "title": "Certain to be a classic, just like the novel, SUPERB!",
            "content": ""
        },
        {
            "username": "851222",
            "userUrl": "https://www.imdb.com/user/ur4405474",
            "reviewLink": "https://www.imdb.com/review/rw7353830",
            "warningSpoilers": true,
            "date": "17 September 2021",
            "rate": "9",
            "helpful": "540 out of 907 found this helpful.",
            "title": "Amazing cinematic experience",
            "content": "Greetings from Lithuania.\"Dune. Part I\" (2021) was amazing cinematic experience. This is a movie that demands to be seen on a big screen, no less. I haven't read a book nor seen previous version of it, therefore all things that i saw story wise were fresh for me. And i won't lie i did felt to be lost here and there, but at the end of the day the storyline was clear.The visual side of this movie was staggering. This is a 100% movie going experience. Special effects looked as real as it gets - if you enjoyed visual side of \"Blade Runner 2049\" you will get same here - grandiose sets, design, sound and all technical stuff - this movie at every scene looked breathtaking. Yet i wished cinematography was done by Roger Deakins, but still it was solid (but could been even better). Acting was very good by all involved - you can't ask for more from such a cast.Overall, few reasons why i did not gave it 10/10 is because it did felt like a set up of a story more then once - way more then once. Also there are some pacing issues here and there. And finally, this movie will loose ~80% of its visual side when watched at home in my opinion, this is a real movie going experience. But at the end i liked it very much and would like to see Part II - fingers crossed!"
        },
        {
            "username": "tabuno",
            "userUrl": "https://www.imdb.com/user/ur0972645",
            "reviewLink": "https://www.imdb.com/review/rw7468274",
            "warningSpoilers": false,
            "date": "22 October 2021",
            "rate": "7",
            "helpful": "187 out of 470 found this helpful.",
            "title": "The Movie Falls Short of Lynch's Movie",
            "content": ""
        },
        {
            "username": "harry_tk_yung",
            "userUrl": "https://www.imdb.com/user/ur1606763",
            "reviewLink": "https://www.imdb.com/review/rw7517822",
            "warningSpoilers": true,
            "date": "6 November 2021",
            "rate": "",
            "helpful": "2 out of 15 found this helpful.",
            "title": "good, but not great",
            "content": "I am a big fan of science fiction, but not of Frank Herbert. His style of ambiguous mysticism is simply not my cup of tea. Isaac Asimov's lucid clarity and sobering logic are far superior. Even Robert A. Heinlein's cynical humour is better. I read the first book of \"Dune\" but completely lost interest in the sequels. I watched David Lynch adaptation in 1984 with mild interest.On all accounts, \"Dune Part 1\" is a well-made movie, but that's it. To compare it to \"Lord of the Rings\" or \"Star Wars\" is tantamount to irresponsibility. I am not even going to waste time in pointing out its inadequacy. I would rather dwell on the positive aspects. As I said, this is a well-made movie.The plot, for those who have not read, or have forgotten (such as myself), is not unlike that of Game of Thrones - a supreme emperor ruling a number of vassal states and playing them off one against another. Here, House Atreides is sent on a mission, purportedly as the emperor's favorite and trusted subject. The real favorite, however, is House Harkonnen that will be benefitted by any setback or outright failure in the mission.The mission is to take control of dessert planet Arrakis (uncanny reminder of Star War's Tatooine) that is hostile in more ways than two. For a start, the climate is murderous, in a very literal sense. The native colossal \"worm\" is even more so. Finally, the indigenous inhabitants, the Freman, is not exactly waiting eagerly to turn over control of the planet, including its \"spice\", one of the rarest natural resources in the universe.Duke Leto Atreides (Oscar Isaac), wise and benevolent, is not prepared to obediently follow the emperor's vision of a violent takeover. He has in fact secretly sent out a sort of goodwill ambassador, his right-hand man warrior Duncan (Jason Momoa) to negotiate a compromise solution. Unfortunately, treachery strikes, ending with death of the Duke and capture of favorite courtesan Lady Jessica (Rebecca Ferguson) and their son Paul (Timothee Chalamet), who manage to escape using their mind-controlling-voice technique of the Bene Gesserit, an ominously mystery cult of \"witches\". They wind up on Arrakis and, after a nail-biting encounter/confrontation with the Fremen, which culminates in an alliance. As well, Paul meets for the first time in flesh Fremen lass Chani (Zendaya) who has appeared in his vision again and again hitherto.The visual splendor of this movie is undisputed. In addition to the above-mentioned, the star-studded cast also includes Stellan Skarsgard, Josh Brolin, Javier Bardem and Charlotte Rampling. Not much challenge though, for the impressive ensemble of acting talents. Only Ferguson and Chalamet have been afforded some scope for acting."
        }
    ],
    "errorMessage": ""
}